## **Importar y exportar datos con Python**

Importar librerías y leer archivo

In [ ]:
#https://www.kaggle.com/hesh97/titanicdataset-traincsv

import pandas as pd
df = pd.read_csv("train.csv")
df.head(10)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

Cambiar nombres de las cabeceras

In [ ]:
cabecera = ["Codigo","Sobrevivió","Clase","Nombre","Sexo","Edad","Niños","Hermanos","Ticket","Tarifa","Cabina","Embarco"]
df.columns = cabecera
df.head(10)

   Codigo  Sobrevivió  Clase  ...   Tarifa Cabina  Embarco
0       1           0      3  ...   7.2500    NaN        S
1       2           1      1  ...  71.2833    C85        C
2       3           1      3  ...   7.9250    NaN        S
3       4           1      1  ...  53.1000   C123        S
4       5           0      3  ...   8.0500    NaN        S
5       6           0      3  ...   8.4583    NaN        Q
6       7           0      1  ...  51.8625    E46        S
7       8           0      3  ...  21.0750    NaN        S
8       9           1      3  ...  11.1333    NaN        S
9      10           1      2  ...  30.0708    NaN        C

[10 rows x 12 columns]

Grabar el archivo con otro nombre

In [ ]:
df.to_csv("Titanic.csv")

Imprimir los primeros 10

In [ ]:
df.head(10)

   Codigo  Sobrevivió  Clase  ...   Tarifa Cabina  Embarco
0       1           0      3  ...   7.2500    NaN        S
1       2           1      1  ...  71.2833    C85        C
2       3           1      3  ...   7.9250    NaN        S
3       4           1      1  ...  53.1000   C123        S
4       5           0      3  ...   8.0500    NaN        S
5       6           0      3  ...   8.4583    NaN        Q
6       7           0      1  ...  51.8625    E46        S
7       8           0      3  ...  21.0750    NaN        S
8       9           1      3  ...  11.1333    NaN        S
9      10           1      2  ...  30.0708    NaN        C

[10 rows x 12 columns]

imprimir los últimos 10

In [ ]:
df.tail(10)

     Codigo  Sobrevivió  Clase  ...   Tarifa Cabina  Embarco
881     882           0      3  ...   7.8958    NaN        S
882     883           0      3  ...  10.5167    NaN        S
883     884           0      2  ...  10.5000    NaN        S
884     885           0      3  ...   7.0500    NaN        S
885     886           0      3  ...  29.1250    NaN        Q
886     887           0      2  ...  13.0000    NaN        S
887     888           1      1  ...  30.0000    B42        S
888     889           0      3  ...  23.4500    NaN        S
889     890           1      1  ...  30.0000   C148        C
890     891           0      3  ...   7.7500    NaN        Q

[10 rows x 12 columns]

Forma del DataFrame

In [ ]:
df.shape

(891, 12)

Altura del DataFrame

In [ ]:
len(df.index)

891

Cuenta los datos del DataFrame

In [ ]:
df.describe()

           Codigo  Sobrevivió       Clase  ...       Niños    Hermanos      Tarifa
count  891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean   446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std    257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min      1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%    223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%    446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%    668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max    891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

El valor más alto de cada una de las columnas

In [ ]:
df.max()
df.min()

Codigo                          1
Sobrevivió                      0
Clase                           1
Nombre        Abbing, Mr. Anthony
Sexo                       female
Edad                         0.42
Niños                           0
Hermanos                        0
Ticket                     110152
Tarifa                          0
dtype: object

Mediana de cada una de las columnas

In [ ]:
df.median()

Codigo        446.0000
Sobrevivió      0.0000
Clase           3.0000
Edad           28.0000
Niños           0.0000
Hermanos        0.0000
Tarifa         14.4542
dtype: float64

Seleccionar una fila específica

In [ ]:
df.loc[2]

Codigo                             3
Sobrevivió                         1
Clase                              3
Nombre        Heikkinen, Miss. Laina
Sexo                          female
Edad                              26
Niños                              0
Hermanos                           0
Ticket              STON/O2. 3101282
Tarifa                         7.925
Cabina                           NaN
Embarco                            S
Name: 2, dtype: object

Imprimir unas filas y columnas específicas

In [ ]:
df.iloc[0:10, 1:4]
sobrevivio = df.iloc[500:800, 1:12]
sobrevivio.median()

Sobrevivió     0.0000
Clase          3.0000
Edad          30.0000
Niños          0.0000
Hermanos       0.0000
Tarifa        15.1229
dtype: float64

Imprimir una celda específica

In [ ]:
df.iloc[3][3]

'Futrelle, Mrs. Jacques Heath (Lily May Peel)'

Revisar datos nulos

In [ ]:
df.isnull()

     Codigo  Sobrevivió  Clase  Nombre  ...  Ticket  Tarifa  Cabina  Embarco
0     False       False  False   False  ...   False   False    True    False
1     False       False  False   False  ...   False   False   False    False
2     False       False  False   False  ...   False   False    True    False
3     False       False  False   False  ...   False   False   False    False
4     False       False  False   False  ...   False   False    True    False
..      ...         ...    ...     ...  ...     ...     ...     ...      ...
886   False       False  False   False  ...   False   False    True    False
887   False       False  False   False  ...   False   False   False    False
888   False       False  False   False  ...   False   False    True    False
889   False       False  False   False  ...   False   False   False    False
890   False       False  False   False  ...   False   False    True    False

[891 rows x 12 columns]

Suma de datos nulos

In [ ]:
df.isnull().sum()

Codigo          0
Sobrevivió      0
Clase           0
Nombre          0
Sexo            0
Edad          177
Niños           0
Hermanos        0
Ticket          0
Tarifa          0
Cabina        687
Embarco         2
dtype: int64

Imprimir el tipo de dato

In [ ]:
df.dtypes

Codigo          int64
Sobrevivió      int64
Clase           int64
Nombre         object
Sexo           object
Edad          float64
Niños           int64
Hermanos        int64
Ticket         object
Tarifa        float64
Cabina         object
Embarco        object
dtype: object

## **Manipulando los valores perdidos**

### 1.	Verificar con la persona que recopilo los datos si se pueda encontrar el valor faltante.
### 2.	Eliminar los datos donde se encuentran los valores perdidos
### 3.	Reemplazar los datos, esto se puede hacer calculando el valor promedio de la variable completa
### 4.	Dejar los datos faltantes, así como datos perdidos.

# Eliminar datos faltantes
•	dropna(axis=0) para eliminar fila

•	dropna(axis=1) para eliminar columnas

Elimina varias filas con ceros

In [ ]:
copia = df.copy()
copia.describe()

           Codigo  Sobrevivió       Clase  ...       Niños    Hermanos      Tarifa
count  891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean   446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std    257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min      1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%    223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%    446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%    668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max    891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [ ]:
aux = copia.dropna(axis=0)

In [ ]:
aux.shape

(183, 12)

Elimina las columnas con datos en ceros

In [ ]:
aux1 = copia.dropna(axis=1)
aux1.shape

(891, 9)

Elimina las filas con datos perdidos en una columna

In [ ]:
aux2 = copia.dropna(subset=["Edad"],axis=0)
aux2.shape

(714, 12)

Que las modificaciones se realicen el conjunto de datos

In [ ]:
copia.dropna(subset=["Edad"],axis=0, inplace=True)
copia.shape

(714, 12)

Elimina las columnas con datos nulos

In [ ]:
copia.dropna(axis=1, inplace=True)
copia.shape

(714, 10)

## Reemplazar datos faltantes

Replace (data a reemplazar, nuevo valor)

In [ ]:
df["Edad"].mean()

29.69911764705882

In [ ]:
import numpy as np
x = df["Edad"].mean()
print(x)
promedio = int(x)
print(promedio)
df['Edad'] = df["Edad"].replace(np.nan, promedio)
df.loc[5,:]

29.69911764705882
29

Codigo                       6
Sobrevivió                   0
Clase                        3
Nombre        Moran, Mr. James
Sexo                      male
Edad                        29
Niños                        0
Hermanos                     0
Ticket                  330877
Tarifa                  8.4583
Cabina                     NaN
Embarco                      Q
Name: 5, dtype: object

In [ ]:
df.shape
df.isnull().sum()
df

     Codigo  Sobrevivió  Clase  ...   Tarifa Cabina  Embarco
0         1           0      3  ...   7.2500    NaN        S
1         2           1      1  ...  71.2833    C85        C
2         3           1      3  ...   7.9250    NaN        S
3         4           1      1  ...  53.1000   C123        S
4         5           0      3  ...   8.0500    NaN        S
..      ...         ...    ...  ...      ...    ...      ...
886     887           0      2  ...  13.0000    NaN        S
887     888           1      1  ...  30.0000    B42        S
888     889           0      3  ...  23.4500    NaN        S
889     890           1      1  ...  30.0000   C148        C
890     891           0      3  ...   7.7500    NaN        Q

[891 rows x 12 columns]

Modificando las variables categóricas

In [ ]:
print(pd.get_dummies(df, columns=["Sexo"]))
df = pd.get_dummies(df, columns=["Sexo"], drop_first=True)
df

     Codigo  Sobrevivió  Clase  ... Embarco  Sexo_female  Sexo_male
0         1           0      3  ...       S            0          1
1         2           1      1  ...       C            1          0
2         3           1      3  ...       S            1          0
3         4           1      1  ...       S            1          0
4         5           0      3  ...       S            0          1
..      ...         ...    ...  ...     ...          ...        ...
886     887           0      2  ...       S            0          1
887     888           1      1  ...       S            1          0
888     889           0      3  ...       S            1          0
889     890           1      1  ...       C            0          1
890     891           0      3  ...       Q            0          1

[891 rows x 13 columns]

     Codigo  Sobrevivió  Clase  ... Cabina  Embarco  Sexo_male
0         1           0      3  ...    NaN        S          1
1         2           1      1  ...    C85        C          0
2         3           1      3  ...    NaN        S          0
3         4           1      1  ...   C123        S          0
4         5           0      3  ...    NaN        S          1
..      ...         ...    ...  ...    ...      ...        ...
886     887           0      2  ...    NaN        S          1
887     888           1      1  ...    B42        S          0
888     889           0      3  ...    NaN        S          0
889     890           1      1  ...   C148        C          1
890     891           0      3  ...    NaN        Q          1

[891 rows x 12 columns]

Agrupando los datos con Python

In [ ]:
bins = [0,5,12,18,35,60,100]
escala = ["1", "2", "3", "4", "5", "6"]
df["Edad"] = pd.cut(df["Edad"], bins, labels=escala)
df

     Codigo  Sobrevivió  Clase  ... Cabina Embarco  Sexo_male
0         1           0      3  ...    NaN       S          1
1         2           1      1  ...    C85       C          0
2         3           1      3  ...    NaN       S          0
3         4           1      1  ...   C123       S          0
4         5           0      3  ...    NaN       S          1
..      ...         ...    ...  ...    ...     ...        ...
886     887           0      2  ...    NaN       S          1
887     888           1      1  ...    B42       S          0
888     889           0      3  ...    NaN       S          0
889     890           1      1  ...   C148       C          1
890     891           0      3  ...    NaN       Q          1

[891 rows x 12 columns]